extreme-load-test.yml
config:
  target: "https://hellobd.news"
  phases:
    - duration: 30
      arrivalRate: 100
      name: "Warmup"
    - duration: 30
      arrivalRate: 150
      name: "Push"
    - duration: 30
      arrivalRate: 250
      name: "Hard Push"
    - duration: 30
      arrivalRate: 350
      name: "Overload"
    - duration: 30
      arrivalRate: 500
      name: "Extreme"
    - duration: 30
      arrivalRate: 650
      name: "Brutal"
    - duration: 30
      arrivalRate: 800
      name: "Savage"
    - duration: 30
      arrivalRate: 900
      name: "Catastrophic"
    - duration: 30
      arrivalRate: 1000
      name: "Max Load"
  defaults:
    headers:
      Accept: "text/html,application/xhtml+xml"
      User-Agent: "Artillery Extreme Validator"
  plugins:
    metrics-by-endpoint:
      useOnlyPath: true

scenarios:
  - name: "Journey: International -> Bangladesh -> Sports"
    weight: 50
    flow:
      - get:
          url: "/category/international"
          expect:
            - statusCode: 200
      - think: 1
      - get:
          url: "/category/bangladesh"
          expect:
            - statusCode: 200
      - think: 1
      - get:
          url: "/category/sports"
          expect:
            - statusCode: 200

  - name: "Journey: Bangladesh -> International"
    weight: 30
    flow:
      - get:
          url: "/category/bangladesh"
          expect:
            - statusCode: 200
      - think: 1
      - get:
          url: "/category/international"
          expect:
            - statusCode: 200

  - name: "Journey: Sports Deep View"
    weight: 20
    flow:
      - get:
          url: "/category/sports"
          expect:
            - statusCode: 200
      - think: 1
      - get:
          url: "/category/sports"
          expect:
            - statusCode: 200